#!/usr/bin/env bash

cat << "EOF"
                                                                                                                                                                                                                                    
||   / |  / /     //   / /     //   ) )                                                                             
||  /  | / /     //____       //___/ /           / __                   __       ___       //      ___        __    
|| / /||/ /     / ____       / __  (    ____    //   ) )   //   / /   //  ) )  //   ) )   //     //   ) )   //  ) ) 
||/ / |  /     //           //    ) )          //   / /   //   / /   //       ((___/ /   //     //   / /   //       
|  /  | /     //____/ /    //____/ /          ((___/ /   ((___( (   //         //__     //     ((___( (   //        
+----------------------------------------------------------------------------------------------------------------+
|                          Скрипт для помощи в проведении тестирования на проникновение                          |
|                                                  v.0.0.1                                                       |
|                                           разработал Magnus Root                                               |
+----------------------------------------------------------------------------------------------------------------+
EOF

# Функция проверки необходимого ПО
need_soft=("curl" "ssh")
need_install_soft=()
for program in "${need_soft[@]}"; do
    if [[ -z "$(which $program)" ]]; then
        echo -e "$program \033[31m✘\033[0m"
        need_install_soft+="$program"
        need_install_soft+=" "
    else
        echo -e "$program \033[32m✔\033[0m"
    fi
done
# Запускаем основной скрипт
while true; do
# Показываем меню и предлагаем выбрать, затем считываем выбор
echo "Что ищем, друг?"
echo "1. SQL-инъекцию"
read choise
# Согласно сделанному выбору выводим информацию
case $choise in
    1) bash Modules/SQLi/start_sqli.sh;;
    *) echo "Пока ничего больше нет";;
esac
done