#!/usr/bin/env bash

cat << "EOF"
                 //   ) )     //    ) )     / /            
                ((           //    / /     / /        ( )  
                  \\        //    / /     / /        / /   
                    ) )    //  \ \ /     / /        / /    
             ((___ / /    ((____\ \     / /____/ / / / 
+------------------------------------------------------------------+
|                                                                  |
|                       Модуль для SQL-инъекций                    |
|                                                                  |
+------------------------------------------------------------------+
EOF

# Выводим меню для SQLi и запускаем нужный скрипт
while true; do
echo "Что будем делать?"
echo "1. Определить наличие SQLi"
echo "2. Проверить наличие UNION BASED"
echo "3. Проверить наличие SQL Blind"
echo "4. Проверить наличие SQL Time-based"
echo "0. Возврат в главное меню"
read choise

case $choise in
    1) bash Modules/SQLi/sqli_check.sh ;;
    2) ;;
    3) ;;
    4) ;;
    0) break ;;
    *) echo "Нет такого варианта" ;;
esac 
done
